converge/meshD/system/blockMeshDict
// Mesh generated on 2021-05-14

// r  (inner)  = 0.9
// R  (outer) = 1.0
// H  (height) = 2.0
// res = 3.0
FoamFile
{
    version  2.0;
    format   ascii;
    class    dictionary;
    object   blockMeshDict;
}

convertToMeters 1.0;

vertices
(
    (  9.0000000000e-01   0.0000000000e+00  -1.0000000000e+00) // 0 
    (  6.3639610307e-01   6.3639610307e-01  -1.0000000000e+00) // 1 
    (  0.0000000000e+00   9.0000000000e-01  -1.0000000000e+00) // 2 
    ( -6.3639610307e-01   6.3639610307e-01  -1.0000000000e+00) // 3 
    ( -9.0000000000e-01   0.0000000000e+00  -1.0000000000e+00) // 4 
    ( -6.3639610307e-01  -6.3639610307e-01  -1.0000000000e+00) // 5 
    (  0.0000000000e+00  -9.0000000000e-01  -1.0000000000e+00) // 6 
    (  6.3639610307e-01  -6.3639610307e-01  -1.0000000000e+00) // 7 
    (  1.0000000000e+00   0.0000000000e+00  -1.0000000000e+00) // 8 
    (  7.0710678119e-01   7.0710678119e-01  -1.0000000000e+00) // 9 
    (  0.0000000000e+00   1.0000000000e+00  -1.0000000000e+00) // 10 
    ( -7.0710678119e-01   7.0710678119e-01  -1.0000000000e+00) // 11 
    ( -1.0000000000e+00   0.0000000000e+00  -1.0000000000e+00) // 12 
    ( -7.0710678119e-01  -7.0710678119e-01  -1.0000000000e+00) // 13 
    (  0.0000000000e+00  -1.0000000000e+00  -1.0000000000e+00) // 14 
    (  7.0710678119e-01  -7.0710678119e-01  -1.0000000000e+00) // 15 
    (  9.0000000000e-01   0.0000000000e+00   1.0000000000e+00) // 16 
    (  6.3639610307e-01   6.3639610307e-01   1.0000000000e+00) // 17 
    (  0.0000000000e+00   9.0000000000e-01   1.0000000000e+00) // 18 
    ( -6.3639610307e-01   6.3639610307e-01   1.0000000000e+00) // 19 
    ( -9.0000000000e-01   0.0000000000e+00   1.0000000000e+00) // 20 
    ( -6.3639610307e-01  -6.3639610307e-01   1.0000000000e+00) // 21 
    (  0.0000000000e+00  -9.0000000000e-01   1.0000000000e+00) // 22 
    (  6.3639610307e-01  -6.3639610307e-01   1.0000000000e+00) // 23 
    (  1.0000000000e+00   0.0000000000e+00   1.0000000000e+00) // 24 
    (  7.0710678119e-01   7.0710678119e-01   1.0000000000e+00) // 25 
    (  0.0000000000e+00   1.0000000000e+00   1.0000000000e+00) // 26 
    ( -7.0710678119e-01   7.0710678119e-01   1.0000000000e+00) // 27 
    ( -1.0000000000e+00   0.0000000000e+00   1.0000000000e+00) // 28 
    ( -7.0710678119e-01  -7.0710678119e-01   1.0000000000e+00) // 29 
    (  0.0000000000e+00  -1.0000000000e+00   1.0000000000e+00) // 30 
    (  7.0710678119e-01  -7.0710678119e-01   1.0000000000e+00) // 31 
);

blocks
(
    // block 0
    hex (0 8 9 1 16 24 25 17) (12 36 300)  simpleGrading (1.0 1.0 1.0)

    // block 1
    hex (1 9 10 2 17 25 26 18) (12 36 300)  simpleGrading (1.0 1.0 1.0)

    // block 2
    hex (2 10 11 3 18 26 27 19) (12 36 300)  simpleGrading (1.0 1.0 1.0)

    // block 3
    hex (3 11 12 4 19 27 28 20) (12 36 300)  simpleGrading (1.0 1.0 1.0)

    // block 4
    hex (4 12 13 5 20 28 29 21) (12 36 300)  simpleGrading (1.0 1.0 1.0)

    // block 5
    hex (5 13 14 6 21 29 30 22) (12 36 300)  simpleGrading (1.0 1.0 1.0)

    // block 6
    hex (6 14 15 7 22 30 31 23) (12 36 300)  simpleGrading (1.0 1.0 1.0)

    // block 7
    hex (7 15 8 0 23 31 24 16) (12 36 300)  simpleGrading (1.0 1.0 1.0)

);

edges
(
    arc 0 1 (7.7942286341e-01  4.5000000000e-01  -1.0000000000e+00)
    arc 8 9 (8.6602540378e-01  5.0000000000e-01  -1.0000000000e+00)
    arc 16 17 (7.7942286341e-01  4.5000000000e-01  1.0000000000e+00)
    arc 24 25 (8.6602540378e-01  5.0000000000e-01  1.0000000000e+00)
    arc 1 2 (4.5000000000e-01  7.7942286341e-01  -1.0000000000e+00)
    arc 9 10 (5.0000000000e-01  8.6602540378e-01  -1.0000000000e+00)
    arc 17 18 (4.5000000000e-01  7.7942286341e-01  1.0000000000e+00)
    arc 25 26 (5.0000000000e-01  8.6602540378e-01  1.0000000000e+00)
    arc 2 3 (-4.5000000000e-01  7.7942286341e-01  -1.0000000000e+00)
    arc 10 11 (-5.0000000000e-01  8.6602540378e-01  -1.0000000000e+00)
    arc 18 19 (-4.5000000000e-01  7.7942286341e-01  1.0000000000e+00)
    arc 26 27 (-5.0000000000e-01  8.6602540378e-01  1.0000000000e+00)
    arc 3 4 (-7.7942286341e-01  4.5000000000e-01  -1.0000000000e+00)
    arc 11 12 (-8.6602540378e-01  5.0000000000e-01  -1.0000000000e+00)
    arc 19 20 (-7.7942286341e-01  4.5000000000e-01  1.0000000000e+00)
    arc 27 28 (-8.6602540378e-01  5.0000000000e-01  1.0000000000e+00)
    arc 4 5 (-7.7942286341e-01  -4.5000000000e-01  -1.0000000000e+00)
    arc 12 13 (-8.6602540378e-01  -5.0000000000e-01  -1.0000000000e+00)
    arc 20 21 (-7.7942286341e-01  -4.5000000000e-01  1.0000000000e+00)
    arc 28 29 (-8.6602540378e-01  -5.0000000000e-01  1.0000000000e+00)
    arc 5 6 (-4.5000000000e-01  -7.7942286341e-01  -1.0000000000e+00)
    arc 13 14 (-5.0000000000e-01  -8.6602540378e-01  -1.0000000000e+00)
    arc 21 22 (-4.5000000000e-01  -7.7942286341e-01  1.0000000000e+00)
    arc 29 30 (-5.0000000000e-01  -8.6602540378e-01  1.0000000000e+00)
    arc 6 7 (4.5000000000e-01  -7.7942286341e-01  -1.0000000000e+00)
    arc 14 15 (5.0000000000e-01  -8.6602540378e-01  -1.0000000000e+00)
    arc 22 23 (4.5000000000e-01  -7.7942286341e-01  1.0000000000e+00)
    arc 30 31 (5.0000000000e-01  -8.6602540378e-01  1.0000000000e+00)
    arc 7 0 (7.7942286341e-01  -4.5000000000e-01  -1.0000000000e+00)
    arc 15 8 (8.6602540378e-01  -5.0000000000e-01  -1.0000000000e+00)
    arc 23 16 (7.7942286341e-01  -4.5000000000e-01  1.0000000000e+00)
    arc 31 24 (8.6602540378e-01  -5.0000000000e-01  1.0000000000e+00)
);

boundary
(
    inner_wall
    {
        type wall;
        faces
        (
            (0 16 17 1)
            (1 17 18 2)
            (2 18 19 3)
            (3 19 20 4)
            (4 20 21 5)
            (5 21 22 6)
            (6 22 23 7)
            (7 23 16 0)
        );
    }

    outer_wall
    {
        type wall;
        faces
        (
            (8 24 25 9)
            (9 25 26 10)
            (10 26 27 11)
            (11 27 28 12)
            (12 28 29 13)
            (13 29 30 14)
            (14 30 31 15)
            (15 31 24 8)
        );
    }

    bottom
    {
        type patch;
        faces
        (
            (16 24 25 17)
            (17 25 26 18)
            (18 26 27 19)
            (19 27 28 20)
            (20 28 29 21)
            (21 29 30 22)
            (22 30 31 23)
            (23 31 24 16)
        );
    }

    top
    {
        type patch;
        faces
        (
            (0 8 9 1)
            (1 9 10 2)
            (2 10 11 3)
            (3 11 12 4)
            (4 12 13 5)
            (5 13 14 6)
            (6 14 15 7)
            (7 15 8 0)
        );
    }

);